artilleryrc.yaml
config:
  target: "http://127.0.0.1:3000"
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true
    ensure: {}
  ensure:
    thresholds:
      - "http.response_time.p95": 150
      - "http.response_time.p99": 250
  phases:
    - name: warm up
      duration: 300
      arrivalRate: 1
      rampTo: 5
    - name: peak load
      duration: 600
      arrivalRate: 5
    - name: cool down
      duration: 300
      arrivalRate: 5
      rampTo: 1
  payload:
    path: ./user_id.csv
    fields:
      - user_id

scenarios:
  - flow:
      - post:
          name: Sign In
          url: /users/{{ user_id }}/access-token
          json:
            password: password
          capture:
            json: $.data.token
            as: token
      - get:
          name: Get Task List
          url: /tasks?sort=deadline&progress=todo&progress=doing
          headers:
            Authorization: Bearer {{ token }}

      - loop:
          - post:
              name: Register New Task
              url: /tasks
              headers:
                Authorization: Bearer {{ token }}
              json:
                content: test content
                deadline: "2023-08-25"
              capture:
                json: $.data.task.id
                as: task_id
          - patch:
              name: Start Task
              url: /tasks/{{ task_id }}?action=start
              headers:
                Authorization: Bearer {{ token }}
          - put:
              name: Update Task Content
              url: /tasks/{{ task_id }}/content
              headers:
                Authorization: Bearer {{ token }}
              json:
                content: updated content
          - patch:
              name: Finish Task
              url: /tasks/{{ task_id }}?action=finish
              headers:
                Authorization: Bearer {{ token }}
        count: 2