artilleryrc.yaml
config:
  target: "http://127.0.0.1:3000"
  phases:
    - name: warm up
      duration: 120
      arrivalRate: 1
      rampTo: 2
    - name: cool down
      duration: 120
      arrivalRate: 2
      rampTo: 1
  payload:
    path: ./user_id.csv
    fields:
      - user_id

scenarios:
  - flow:
      # sign in
      - post:
          url: /users/{{ user_id }}/token
          json:
            password: password
          capture:
            json: $.data.token
            as: token
      # get tasks
      - get:
          url: /tasks?sort=deadline&progress=todo&progress=doing
          headers:
            Authorization: Bearer {{ token }}

      - loop:
          # register new task
          - post:
              url: /tasks
              headers:
                Authorization: Bearer {{ token }}
              json:
                content: test content
                deadline: "2023-08-25"
              capture:
                json: $.data.task.id
                as: task_id
          # start task
          - patch:
              url: /tasks/{{ task_id }}
              headers:
                Authorization: Bearer {{ token }}
              json:
                action: start
          # update content
          - put:
              url: /tasks/{{ task_id }}/content
              headers:
                Authorization: Bearer {{ token }}
              json:
                content: updated content
          # finish task
          - patch:
              url: /tasks/{{ task_id }}
              headers:
                Authorization: Bearer {{ token }}
              json:
                action: finish
        count: 2