load_test.yaml
config:
  target: "http://127.0.0.1:3000"
  phases:
    - name: warm up
      duration: 120
      arrivalRate: 1
      rampTo: 2
    - name: cool down
      duration: 120
      arrivalRate: 2
      rampTo: 1
  payload:
    path: ./.artillery/id.csv
    fields:
      - user_id

scenarios:
  - name: basic
    flow:
      # sign up
      - post:
          url: /users
          json:
            id: "{{ user_id }}"
            password: password
          capture:
            json: $.message
            as: created
      - loop:
          # sign in
          - post:
              url: /users/{{ user_id }}/token
              json:
                password: password
              capture:
                json: $.data.token
                as: token
          - loop:
              # get tasks
              - get:
                  url: /tasks?sort=deadline&progress=todo&progress=doing
                  headers:
                    Authorization: Bearer {{ token }}
              - think: 2
              # register new task
              - post:
                  url: /tasks
                  headers:
                    Authorization: Bearer {{ token }}
                  json:
                    content: test content
                    deadline: "2023-08-25"
                  capture:
                    json: $.data.task.id
                    as: task_id
              - think: 1
              # start task
              - patch:
                  url: /tasks/{{ task_id }}
                  headers:
                    Authorization: Bearer {{ token }}
                  json:
                    action: start
              - think: 1
              # update memo
              - put:
                  url: /tasks/{{ task_id }}/memo
                  headers:
                    Authorization: Bearer {{ token }}
                  json:
                    memo: test memo
              - think: 1
              # finish task
              - patch:
                  url: /tasks/{{ task_id }}
                  headers:
                    Authorization: Bearer {{ token }}
                  json:
                    action: finish
              - think: 1
            count: 2
          - think: 3
            # loop back to get tasks
        count: 2
        # loop back to sign in